benchmark_results/normal/bun_kubernetes_1/fibonacci-blocker_30_c100.txt
Bombarding http://192.168.49.2:31000/fibonacci-blocker/30 with 10000 request(s) using 100 connection(s)
 10000 / 10000 [========================================================================================================================================================] 100.00% 332/s 30s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       332.64     169.07     863.10
  Latency      299.05ms    65.83ms   687.78ms
  HTTP codes:
    1xx - 0, 2xx - 10000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    62.97KB/s