benchmark_results/normal/bun_kubernetes_1/json-processing_c10.txt
Bombarding http://192.168.49.2:31000/json-processing with 10000 request(s) using 10 connection(s)
 10000 / 10000 [========================================================================================================================================================] 100.00% 2932/s 3s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      3087.03    1437.37    5945.01
  Latency        3.23ms     9.22ms    67.77ms
  HTTP codes:
    1xx - 0, 2xx - 10000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:   112.98MB/s