benchmark_results/normal/bun_kubernetes_1/json-small_c10.txt
Bombarding http://192.168.49.2:31000/json-small with 100000 request(s) using 10 connection(s)
 100000 / 100000 [=====================================================================================================================================================] 100.00% 16103/s 6s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     16205.58   15009.35   48467.68
  Latency      606.77us     3.41ms    69.20ms
  HTTP codes:
    1xx - 0, 2xx - 100000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.27MB/s