benchmark_results/normal/bun_kubernetes_1/memory-intensive_1_c10.txt
Bombarding http://192.168.49.2:31000/memory-intensive/1 with 100000 request(s) using 10 connection(s)
 100000 / 100000 [=====================================================================================================================================================] 100.00% 2755/s 36s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      2758.10    1515.15    5407.88
  Latency        3.62ms     9.37ms    84.42ms
  HTTP codes:
    1xx - 0, 2xx - 100000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:   663.01KB/s