benchmark_results/normal/bun_kubernetes_1/memory-intensive_1_c100.txt
Bombarding http://192.168.49.2:31000/memory-intensive/1 with 100000 request(s) using 100 connection(s)
 100000 / 100000 [=====================================================================================================================================================] 100.00% 3990/s 25s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      3989.92    2031.91    7265.37
  Latency       25.03ms    16.53ms   112.99ms
  HTTP codes:
    1xx - 0, 2xx - 100000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     0.94MB/s