benchmark_results/normal/bun_kubernetes_1/video-serving_c10.txt
Bombarding http://192.168.49.2:31000/video-serving with 10000 request(s) using 10 connection(s)
 10000 / 10000 [========================================================================================================================================================] 100.00% 203/s 49s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       204.56      67.87     548.78
  Latency       49.02ms    29.71ms   234.75ms
  HTTP codes:
    1xx - 0, 2xx - 10000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     5.07GB/s