benchmark_results/normal/bun_kubernetes_1/video-serving_c100.txt
Bombarding http://192.168.49.2:31000/video-serving with 10000 request(s) using 100 connection(s)
 10000 / 10000 [========================================================================================================================================================] 100.00% 236/s 42s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       240.40     116.13    1030.82
  Latency      419.01ms   180.80ms      2.15s
  HTTP codes:
    1xx - 0, 2xx - 10000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     5.90GB/s